并发消息测试.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.6.3">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Test Plan">
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
    </TestPlan>
    <hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="并发消息测试">
        <intProp name="ThreadGroup.num_threads">500</intProp>
        <intProp name="ThreadGroup.ramp_time">1</intProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="循环控制器">
          <stringProp name="LoopController.loops">30</stringProp>
          <boolProp name="LoopController.continue_forever">false</boolProp>
        </elementProp>
      </ThreadGroup>
      <hashTree>
        <eu.luminis.jmeter.wssampler.RequestResponseWebSocketSampler guiclass="eu.luminis.jmeter.wssampler.RequestResponseWebSocketSamplerGui" testclass="eu.luminis.jmeter.wssampler.RequestResponseWebSocketSampler" testname="WebSocket request-response Sampler">
          <boolProp name="createNewConnection">true</boolProp>
          <boolProp name="TLS">false</boolProp>
          <stringProp name="server">127.0.0.1</stringProp>
          <stringProp name="port">8000</stringProp>
          <stringProp name="path">ws?token=eyJhbGciOiJIUzI1NiJ9.eyJpZCI6MTc3MzczOTM2Mjc2MTM5OCwiYXZhdGFyIjoiaHR0cDovLzQ3LjExMS4yMi4xODM6OTAwMC96enotaW0tYXZhdGFyLzIwMjYvMDMvMTcvMTc3MzczOTM2Mjc2MTM5OC8xNzczNzM5MzYyNzYxMzk4LmpwZWciLCJhY2NvdW50IjoiMTc3MzczOTM2Mjc1OXFud1E0NCIsInVzZXJuYW1lIjoi55So5oi35LiAIiwiZXhwIjoxNzc0MjY3NjE2fQ.rbDZfIeSPyv5xXeSH-p90_cCEtNIThVp4wYZ1Oag6wg</stringProp>
          <stringProp name="connectTimeout">20000</stringProp>
          <stringProp name="payloadType">Binary</stringProp>
          <stringProp name="requestData">0102030401000100000000ff000001357b226964223a2237343431383032323235343833393431363530222c2273656e6465724964223a313737333733393336323736313339382c22636f6e766572736174696f6e4964223a22313737333733393434353838363631395f31373733373339333632373631333938222c2272656365697665724964223a2231373733373339343435383836363139222c226d736754797065223a312c22636f6e74656e74223a22e4bda0e5a5bd222c2273656e64537461747573223a302c2273656e6454696d65223a22323032362d30332d32332031393a30353a3132222c2266696c654964223a22222c2266696c654e616d65223a22222c2266696c6553697a65223a302c226c6f63616c50617468223a22222c2270726576696577426173653634223a22222c2272656d6f746550617468223a22227d</stringProp>
          <stringProp name="readTimeout">6000</stringProp>
          <boolProp name="loadDataFromFile">false</boolProp>
        </eu.luminis.jmeter.wssampler.RequestResponseWebSocketSampler>
        <hashTree/>
        <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="查看结果树">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
        <ResultCollector guiclass="SummaryReport" testclass="ResultCollector" testname="汇总报告">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
      </hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>